/*Дана програма призначена для визначення
*суми всіх числел, кратних 7, в діапазоні від 1 до 150*/
#include <stdio.h>
#include <math.h>
#include <locale.h>//підключення бібліотек
int main(){
    setlocale(LC_CTYPE, "ua");
    int sum = 0;
    for (int i = 1; i <= 150; i++){
        if (i % 7 == 0){
            sum += i;
        }
    }
    printf("Сума всіх чисел, кратних 7, в діапазоні (1;150) дорівнює %d", sum);//виведення результату
    
 return 0;//кінець програми
}